pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr2632.h
/*************************************************************
* Backup Memory Module
*************************************************************/
#define __MSP430_HAS_BKMEM__                  /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_BKMEM__ 0x0660
#define BKMEM_BASE             __MSP430_BASEADDRESS_BKMEM__

#define __MSP430_HAS_BACKUP_RAM__                /* Legacy module name */
#define BAK_RAM_BASE           BKMEM_BASE     /* Legacy module name */

sfr_w(BAKMEM0);                               /* Battery Backup Memory 0 */
sfr_b(BAKMEM0_L);                             /* Battery Backup Memory 0 */
sfr_b(BAKMEM0_H);                             /* Battery Backup Memory 0 */
sfr_w(BAKMEM1);                               /* Battery Backup Memory 1 */
sfr_b(BAKMEM1_L);                             /* Battery Backup Memory 1 */
sfr_b(BAKMEM1_H);                             /* Battery Backup Memory 1 */
sfr_w(BAKMEM2);                               /* Battery Backup Memory 2 */
sfr_b(BAKMEM2_L);                             /* Battery Backup Memory 2 */
sfr_b(BAKMEM2_H);                             /* Battery Backup Memory 2 */
sfr_w(BAKMEM3);                               /* Battery Backup Memory 3 */
sfr_b(BAKMEM3_L);                             /* Battery Backup Memory 3 */
sfr_b(BAKMEM3_H);                             /* Battery Backup Memory 3 */
sfr_w(BAKMEM4);                               /* Battery Backup Memory 4 */
sfr_b(BAKMEM4_L);                             /* Battery Backup Memory 4 */
sfr_b(BAKMEM4_H);                             /* Battery Backup Memory 4 */
sfr_w(BAKMEM5);                               /* Battery Backup Memory 5 */
sfr_b(BAKMEM5_L);                             /* Battery Backup Memory 5 */
sfr_b(BAKMEM5_H);                             /* Battery Backup Memory 5 */
sfr_w(BAKMEM6);                               /* Battery Backup Memory 6 */
sfr_b(BAKMEM6_L);                             /* Battery Backup Memory 6 */
sfr_b(BAKMEM6_H);                             /* Battery Backup Memory 6 */
sfr_w(BAKMEM7);                               /* Battery Backup Memory 7 */
sfr_b(BAKMEM7_L);                             /* Battery Backup Memory 7 */
sfr_b(BAKMEM7_H);                             /* Battery Backup Memory 7 */
sfr_w(BAKMEM8);                               /* Battery Backup Memory 8 */
sfr_b(BAKMEM8_L);                             /* Battery Backup Memory 8 */
sfr_b(BAKMEM8_H);                             /* Battery Backup Memory 8 */
sfr_w(BAKMEM9);                               /* Battery Backup Memory 9 */
sfr_b(BAKMEM9_L);                             /* Battery Backup Memory 9 */
sfr_b(BAKMEM9_H);                             /* Battery Backup Memory 9 */
sfr_w(BAKMEM10);                              /* Battery Backup Memory 10 */
sfr_b(BAKMEM10_L);                            /* Battery Backup Memory 10 */
sfr_b(BAKMEM10_H);                            /* Battery Backup Memory 10 */
sfr_w(BAKMEM11);                              /* Battery Backup Memory 11 */
sfr_b(BAKMEM11_L);                            /* Battery Backup Memory 11 */
sfr_b(BAKMEM11_H);                            /* Battery Backup Memory 11 */
sfr_w(BAKMEM12);                              /* Battery Backup Memory 12 */
sfr_b(BAKMEM12_L);                            /* Battery Backup Memory 12 */
sfr_b(BAKMEM12_H);                            /* Battery Backup Memory 12 */
sfr_w(BAKMEM13);                              /* Battery Backup Memory 13 */
sfr_b(BAKMEM13_L);                            /* Battery Backup Memory 13 */
sfr_b(BAKMEM13_H);                            /* Battery Backup Memory 13 */
sfr_w(BAKMEM14);                              /* Battery Backup Memory 14 */
sfr_b(BAKMEM14_L);                            /* Battery Backup Memory 14 */
sfr_b(BAKMEM14_H);                            /* Battery Backup Memory 14 */
sfr_w(BAKMEM15);                              /* Battery Backup Memory 15 */
sfr_b(BAKMEM15_L);                            /* Battery Backup Memory 15 */
sfr_b(BAKMEM15_H);                            /* Battery Backup Memory 15 */

/************************************************************
* Captivate
************************************************************/
#define __MSP430_HAS_CAPTIVATE__                /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_CAPTIVATE__ 0x0A00
#define CAPTIVATE_USER_BASE    __MSP430_HAS_CAPTIVATE__

sfr_w(CAPIE);                                 /* Captivate Interrupt Enable Register */
sfr_b(CAPIE_L);                               /* Captivate Interrupt Enable Register */
sfr_b(CAPIE_H);                               /* Captivate Interrupt Enable Register */
sfr_w(CAPIFG);                                /* Captivate Interrupt Flag Register */
sfr_b(CAPIFG_L);                              /* Captivate Interrupt Flag Register */
sfr_b(CAPIFG_H);                              /* Captivate Interrupt Flag Register */
sfr_w(CAPIV);                                 /* Captivate Interrupt Vector Register */
sfr_b(CAPIV_L);                               /* Captivate Interrupt Vector Register */
sfr_b(CAPIV_H);                               /* Captivate Interrupt Vector Register */

/* CAPIE */
#define EOCIEN                 (0x0001)       /* End of conversion interrupt enable */
#define CAPDTCTIEN             (0x0002)       /* Captivate detection interrupt enable */
#define CAPTIEN                (0x0004)       /* Captivate Timer interrupt enable */
#define CAPCNTRIEN             (0x0008)       /* Captivate Conversion Counter interrupt enable */
#define CAPMAXIEN              (0x0100)       /* Captivate maximum count interrupt enable */

#define EOCIEN_L               (0x0001)       /* End of conversion interrupt enable */
#define CAPDTCTIEN_L           (0x0002)       /* Captivate detection interrupt enable */
#define CAPTIEN_L              (0x0004)       /* Captivate Timer interrupt enable */
#define CAPCNTRIEN_L           (0x0008)       /* Captivate Conversion Counter interrupt enable */

#define CAPMAXIEN_H            (0x0001)       /* Captivate maximum count interrupt enable */

/* CAPIFG */
#define EOCIFG                 (0x0001)       /* End of conversion interrupt flag */
#define CAPDTCTIFG             (0x0002)       /* Captivate detection interrupt flag */
#define CAPTIFG                (0x0004)       /* Captivate Timer interrupt flag */
#define CAPCNTRIFG             (0x0008)       /* Captivate Conversion Counter interrupt flag */
#define CAPMAXIFG              (0x0100)       /* Captivate maximum count interrupt flag */

#define EOCIFG_L               (0x0001)       /* End of conversion interrupt flag */
#define CAPDTCTIFG_L           (0x0002)       /* Captivate detection interrupt flag */
#define CAPTIFG_L              (0x0004)       /* Captivate Timer interrupt flag */
#define CAPCNTRIFG_L           (0x0008)       /* Captivate Conversion Counter interrupt flag */

#define CAPMAXIFG_H            (0x0001)       /* Captivate maximum count interrupt flag */

/* CAPIV Definitions */
#define CAPIV__NONE            (0x0000)       /* No Interrupt pending */
#define CAPIV__EOCIFG          (0x0002)       /* End of conversion interrupt, Flag = EOCIFG */
#define CAPIV__CAPDTCTIFG      (0x0004)       /* Detection interrupt, Flag = CAPDTCTIFG */
#define CAPIV__CAPTIFG         (0x0006)       /* Captivate Timer interrupt, Flag = CAPTIFG */
#define CAPIV__CAPCNTRIFG      (0x0008)       /* Captivate Counter interrupt, Flag = CAPCNTRIFG */
#define CAPIV__CAPMAXIFG       (0x000A)       /* max count value reached, Flag = CAPMAXIFG */


